# Monday

### Virtual Environment and Request Module

### Sending A Request
- using the Github API

In [1]:
# ssending a request and logging the response code
import requests
r = requests.get('https://api.github.com/users/ajakaiye33')
print(r)
print(type(r))

<Response [200]>
<class 'requests.models.Response'>

### Accessing the Response Content
- to access the content of the information captured in the r variable, we used the `content` method of request module

In [2]:
# accessing the content that we requested from the URL. 
# The output is in string format but we need to transform it into data
data = r.content
print(data)

b'{"login":"ajakaiye33","id":12386109,"node_id":"MDQ6VXNlcjEyMzg2MTA5","avatar_url":"https://avatars3.githubusercontent.com/u/12386109?v=4","gravatar_id":"","url":"https://api.github.com/users/ajakaiye33","html_url":"https://github.com/ajakaiye33","followers_url":"https://api.github.com/users/ajakaiye33/followers","following_url":"https://api.github.com/users/ajakaiye33/following{/other_user}","gists_url":"https://api.github.com/users/ajakaiye33/gists{/gist_id}","starred_url":"https://api.github.com/users/ajakaiye33/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/ajakaiye33/subscriptions","organizations_url":"https://api.github.com/users/ajakaiye33/orgs","repos_url":"https://api.github.com/users/ajakaiye33/repos","events_url":"https://api.github.com/users/ajakaiye33/events{/privacy}","received_events_url":"https://api.github.com/users/ajakaiye33/received_events","type":"User","site_admin":false,"name":"Hedgar ","company":null,"blog":"","location":"Earth, Milky Way","email":null,"hireable":null,"bio":"Machine Learning |Data Analysis | Cloud Technology | Python \\r\\n--\\r\\n\\r\\n\\r\\n\\"Wenn ich raste, roste ich\\"","twitter_username":null,"public_repos":50,"public_gists":1,"followers":3,"following":26,"created_at":"2015-05-10T23:20:05Z","updated_at":"2020-08-01T20:25:01Z"}'

### Converting the Response
- the request object has a json() which help to convert strings to dictionary

In [3]:
# converting data from JSON into Python dictionary and outputting all key-value pairs
data = r.json() # converting the data from a string to a dictionary
for k, v in data.items():
    print(f'Key: {k} \t Value: {v}')
print(data['name']) # accessing the data directly

Key: login 	 Value: ajakaiye33
Key: id 	 Value: 12386109
Key: node_id 	 Value: MDQ6VXNlcjEyMzg2MTA5
Key: avatar_url 	 Value: https://avatars3.githubusercontent.com/u/12386109?v=4
Key: gravatar_id 	 Value:
Key: url 	 Value: https://api.github.com/users/ajakaiye33
Key: html_url 	 Value: https://github.com/ajakaiye33
Key: followers_url 	 Value: https://api.github.com/users/ajakaiye33/followers
Key: following_url 	 Value: https://api.github.com/users/ajakaiye33/following{/other_user}
Key: gists_url 	 Value: https://api.github.com/users/ajakaiye33/gists{/gist_id}
Key: starred_url 	 Value: https://api.github.com/users/ajakaiye33/starred{/owner}{/repo}
Key: subscriptions_url 	 Value: https://api.github.com/users/ajakaiye33/subscriptions
Key: organizations_url 	 Value: https://api.github.com/users/ajakaiye33/orgs
Key: repos_url 	 Value: https://api.github.com/users/ajakaiye33/repos
Key: events_url 	 Value: https://api.github.com/users/ajakaiye33/events{/privacy}
Key: received_events_url 	 Value: https://api.github.com/users/ajakaiye33/received_events
Key: type 	 Value: User
Key: site_admin 	 Value: False
Key: name 	 Value: Hedgar
Key: company 	 Value: None
Key: blog 	 Value:
Key: location 	 Value: Earth, Milky Way
Key: email 	 Value: None
Key: hireable 	 Value: None
Key: bio 	 Value: Machine Learning |Data Analysis | Cloud Technology | Python
--


"Wenn ich raste, roste ich"
Key: twitter_username 	 Value: None
Key: public_repos 	 Value: 50
Key: public_gists 	 Value: 1
Key: followers 	 Value: 3
Key: following 	 Value: 26
Key: created_at 	 Value: 2015-05-10T23:20:05Z
Key: updated_at 	 Value: 2020-08-01T20:25:01Z
Hedgar

### Passing Parameters

In [4]:
# outputting specific key-value pairs from data
# one way of passing parameter: `q='parameter'`
r = requests.get('https://api.github.com/search/repositories?q=language:python')
print(r)
data = r.json()
print(data['total_count']) # output the total number of repositories that use python

<Response [200]>
5714162

In [5]:
# exercise
# get the number of repositories in the javascript language
r = requests.get('https://api.github.com/search/repositories?q=language:javascript')
data = r.json()
print(data['total_count'])

9314144

# Tuesday

### Pandas
- Pandas is a better tool for data handling. Its essentially excel on steroids.
- Pandas is an intelligent fusion of the powers of python and `SQL`
- The usefulness of the pandas package are as follows:
    - Calculate statistics and answer questions about the data like average, median, max, and min of each column
    - Finding correlation between columns
    - Tracking the distribution of one or more columns
    - Visualizing the data with the help of maatplotlib, using plot, bar histograms, e.t.c
    - Cleaning and filtering data, whether it is missing or incomplete, just by applying a user-defined function(UDF) or built-in function
    - Transforming tabular data into python to work with
    - Exporting the data into a CSV, other file or database
    - Feature engineer new columns that can be applied to your analysis

### Key Terms
- `Series`: one-dimensional labeled array capable of holding data of any type
- `DataFrame`:spreadsheet
- `Axis`: Column or row, axis=0 by row; axis= 1 by column
- `Record`: A single row
- `dtype`: Data type for Dataframe or series object
- `Time Series`: Series object that uses time intervals like tracking weather by the hour

### Importing Pandas

In [6]:
# importing the pandas package
import pandas as pd # industry standard name of pd when importing

### Creating A Dataframe
- Pandas dataframe is a tabular data structure with rows and columns like an excel spreadsheet

In [8]:
# using the from_dict method to convert a dictionary into a Pandas Dataframe
import random
random.seed(3) # generate same random numbers every time, number used doesn't matter
names = ['Jess', 'Jordan', 'Sandy', 'Ted', 'Barney','Tyler', 'Rebecca']
age = [random.randint(18, 35) for x in range(len(names))]
people = {'names':names, 'ages':age}
df = pd.DataFrame.from_dict(people)
print(df)

     names  ages
0     Jess    25
1   Jordan    35
2    Sandy    22
3      Ted    29
4   Barney    33
5    Tyler    20
6  Rebecca    18

### Accessing Data

#### Indexing by Column
- This is the same as accessing data in a dictionary with key

In [9]:
# directly selecting a column in pandas
print(df['ages'])

0    25
1    35
2    22
3    29
4    33
5    20
6    18
Name: ages, dtype: int64

In [10]:
print(df['ages'][3]) # select the value of ages in the fourth row (0- index based)
# print(df[4]) doesn't work, 4 is not a column name

29

#### Indexing by Record
- we use `loc` to access an entire record

In [11]:
# directly selecting a record in pandas using .loc
print(df.loc[0])
print(df.loc[0]['names']) # selecting the value at record 0 in the 'names column'

names    Jess
ages       25
Name: 0, dtype: object
Jess

### Slicing a DataFrame
- works the same way as python list: `start`,`stop`,`step`

In [12]:
# slicing a DataFrame to grab specific records
print(df[2:5])

    names  ages
2   Sandy    22
3     Ted    29
4  Barney    33

### Built-in Methods

#### head()

In [13]:
# accessing the top 5 records using .head()
df.head()

    names  ages
0    Jess    25
1  Jordan    35
2   Sandy    22
3     Ted    29
4  Barney    33

#### tail()

In [14]:
# accesing the bottom 3 records using .tail()
df.tail()

     names  ages
2    Sandy    22
3      Ted    29
4   Barney    33
5    Tyler    20
6  Rebecca    18

#### key()

In [15]:
# accessing the column header (keys) using the .keys() method
header = df.keys()
print(header)

Index(['names', 'ages'], dtype='object')

#### .shape

In [16]:
# checking the shape, which is the number of records and columns
print(df.shape)

(7, 2)

#### describe()
- `min`, `max`, `25%`, `50%`, `mean`

In [17]:
# checking the general statistics of the dataframe using .describe() only on numerical columns
df.describe()

            ages
count   7.000000
mean   26.000000
std     6.531973
min    18.000000
25%    21.000000
50%    25.000000
75%    31.000000
max    35.000000

#### sort_values()

In [18]:
## sort based on a given column, but keep the DataFrame in tact using sort_values()
df = df.sort_values('ages')
df.head()

     names  ages
6  Rebecca    18
5    Tyler    20
2    Sandy    22
0     Jess    25
3      Ted    29

### Filtration

#### Conditionals

In [19]:
# using a conditional to create a true/false column to work with
can_drink = df['ages'] > 21
print(can_drink)

6    False
5    False
2     True
0     True
3     True
4     True
1     True
Name: ages, dtype: bool

#### Subsetting

In [20]:
# using sunsetting to filter out records and keep dataframe intact
df[df['ages'] > 21]

    names  ages
2   Sandy    22
0    Jess    25
3     Ted    29
4  Barney    33
1  Jordan    35

### Colum Transformations

#### Generating a New Column with Data
- its is done in same way as adding a new key-value pair into a dictionary

In [22]:
# generating a new column of fake data for each record in dataframe represent customer tenure
random.seed(321)
tenure = [random.randint(0,10) for x in range(len(df))]
df['tenure'] = tenure # same as adding a new key-value pair in a dictionary
df.head()

     names  ages  tenure
6  Rebecca    18       4
5    Tyler    20       6
2    Sandy    22       2
0     Jess    25       5
3      Ted    29       8

#### apply()
- critical to `feature engineering`

In [23]:
# feature engineering a new column from known data using UDF
def ageGroup(age):
    return 'Teenager' if age < 21 else 'Adult'
df['age_group'] = df['ages'].apply(ageGroup)
df.head(10)

     names  ages  tenure age_group
6  Rebecca    18       4  Teenager
5    Tyler    20       6  Teenager
2    Sandy    22       2     Adult
0     Jess    25       5     Adult
3      Ted    29       8     Adult
4   Barney    33       7     Adult
1   Jordan    35       5     Adult

### Aggregation
- similar to the groupby() function of SQL

#### groupby()

In [24]:
# grouping the records together to count how many records in each group
df.groupby('age_group', as_index=False).count().head()

  age_group  names  ages  tenure
0     Adult      5     5       5
1  Teenager      2     2       2

#### mean()

In [25]:
# grouping the data to see average of all columns
df.groupby('age_group', as_index=False).mean().head()

  age_group  ages  tenure
0     Adult  28.8     5.4
1  Teenager  19.0     5.0

#### groupby() with Multiple Columnm

In [27]:
# grouping information by their age group, then by their tenure
df.groupby(['age_group', 'tenure'], as_index=False).count().head()

  age_group  tenure  names  ages
0     Adult       2      1     1
1     Adult       5      2     2
2     Adult       7      1     1
3     Adult       8      1     1
4  Teenager       4      1     1

In [30]:
df.groupby(['age_group', 'tenure']).agg({'tenure':'count'})

                  tenure
age_group tenure
Adult     2            1
          5            2
          7            1
          8            1
Teenager  4            1
          6            1

### Adding a Record

In [32]:
# adding a record to the bottom of the Dataframe
df.loc[7] = [25, 'Jess', 2, 'Adult'] # add a record
df.head()

     names ages  tenure age_group
6  Rebecca   18       4  Teenager
5    Tyler   20       6  Teenager
2    Sandy   22       2     Adult
0     Jess   25       5     Adult
3      Ted   29       8     Adult

#### drop_duplicates()

In [33]:
# removing duplicates based on same names
df = df.drop_duplicates(subset='names')
df.head(10)

     names  ages  tenure age_group
6  Rebecca    18       4  Teenager
5    Tyler    20       6  Teenager
2    Sandy    22       2     Adult
0     Jess    25       5     Adult
3      Ted    29       8     Adult
4   Barney    33       7     Adult
1   Jordan    35       5     Adult
7       25  Jess       2     Adult

### Pandas Joins
- like SQL pandas uses the join function to combine data from different dataframe

#### Creating a Second DataFrame

In [34]:
# creating another fake DataFrame to work with, having same names and a new ratings colums
ratings ={
    'names':['Jess', 'Tyler', 'Ted'], 'ratings' : [10,9,6]
}
ratings = df.from_dict(ratings)
ratings.head()

   names  ratings
0   Jess       10
1  Tyler        9
2    Ted        6

#### Inner Join

In [35]:
# perform an inner join with our df and ratings datframe based on names, get data that matches
matched_ratings = df.merge(ratings, on='names', how='inner')
matched_ratings.head()

   names ages  tenure age_group  ratings
0  Tyler   20       6  Teenager        9
1   Jess   25       5     Adult       10
2    Ted   29       8     Adult        6

#### Outer Join

In [36]:
# performing an outer loin with our df and ratings Dataframe based on names, get all the data
all_ratings = df.merge(ratings, on='names', how='outer')
all_ratings.head()

     names ages  tenure age_group  ratings
0  Rebecca   18       4  Teenager      NaN
1    Tyler   20       6  Teenager      9.0
2    Sandy   22       2     Adult      NaN
3     Jess   25       5     Adult     10.0
4      Ted   29       8     Adult      6.0

### Dataset Pipeline
- Performing Exploratory Analysis
- Data Cleaning
- Feature Engineering